{
  "navbar": {
    "dashboard": "Dashboard",
    "employees": "Employees"
  },
  "list": {
    "employees": "Employees"
  },
  "employee": {
    "id": "ID",
    "name": "Name",
    "surname": "Surname",
    "employmentDate": "Date of employment",
    "skills": "skill",
    "projects": "project",
    "manager": "Manager"
  },
  "project": {
    "pzu": "PZU Group is one of the largest financial institutions in Poland and in Central and Eastern Europe. The Group is led by Powszechny Zakład Ubezpieczeń S.A. (PZU) – a company quoted on the Warsaw Stock Exchange.",
    "orlen": "Polish multinational oil refiner, petrol retailer and natural gas trader headquartered in Płock, Poland.",
    "aliorbank": "Alior Bank SA is a universal bank that offers a range of financial services to both individual and business customers. The bank's main activities involve combining traditional banking principles with innovative solutions, thereby contributing to the development of the Polish banking sector.",
    "santander bank": "Banco Santander is a leading commercial bank, founded in 1857 and headquartered in Spain. It has a meaningful presence in 10 core markets in the Europe, North America and South America regions, and is one of the largest banks in the world by market capitalization.",
    "lot": "LOT Polish Airlines is a modern airline connecting New Europe with the world. It provides almost 9 million passengers a year with the shortest and most comfortable travel options to more than 100 destinations worldwide via Warsaw, a competitive hub offering fast connections.",
    "pgnig": "PGNiG's core business consists in the production and sale of natural gas and crude oil. Both domestically and abroad, we are engaged in geophysical and geological research, exploration for and production of hydrocarbons, as well as preparation of products for sale."
  },
  "message": {
    "title": "Messages",
    "details": "Details",
    "messages": {
      "fetch": "EmployeesService: Fetched all employees",
      "random": "EmployeesService: Fetched random employees",
      "select": "ListComponent: Selected employee of id=",
      "add": "ListComponent: Added employee of id=",
      "delete": "ListComponent: Deleted employee of id=",
      "update": "ListComponent: Updated data of the employee of id="
    }
  },
  "dropdown": {
    "option": "Select"
  },
  "input": {
    "placeholder": {
      "search": "Search",
      "name": "Name",
      "surname": "Surname"
    }
  },
  "button": {
    "save": "Save",
    "show": "Show",
    "clear": "Clear",
    "back": "Back"
  },
  "error": {
    "name": {
      "required": "Name is required!",
      "minLength": "Name too short!",
      "maxLength": "Name too long!"
    },
    "surname": {
      "required": "Surname is required!",
      "minLength": "Surname too short!",
      "maxLength": "Surname too long!"
    },
    "employmentDate": {
      "required": "Date is required!",
      "pattern": "Incorrect date format!"
    }
  }
}
